Revit 2027 API
BuiltInFailures.RebarShapeFailures.CrankWithHookOrEndTreatmentAtTheSameEnd Property
 Cannot add crank, hooks and end treatments at the same end.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CrankWithHookOrEndTreatmentAtTheSameEnd { get; }
Public Shared ReadOnly Property CrankWithHookOrEndTreatmentAtTheSameEnd As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CrankWithHookOrEndTreatmentAtTheSameEnd {
	FailureDefinitionId^ get ();
}
static member CrankWithHookOrEndTreatmentAtTheSameEnd : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace